-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 01 月 02 日 15:21
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `動物園商品`
--

-- --------------------------------------------------------

--
-- 資料表結構 `供應商`
--

CREATE TABLE `供應商` (
  `sid` int(255) NOT NULL,
  `供應商名稱` varchar(255) NOT NULL,
  `供應商地址` varchar(255) NOT NULL,
  `供應商電話` varchar(255) NOT NULL,
  `供應項目` varchar(255) NOT NULL,
  `更新時間` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `供應商`
--

INSERT INTO `供應商` (`sid`, `供應商名稱`, `供應商地址`, `供應商電話`, `供應項目`, `更新時間`) VALUES
(1, '嘉冠貿易有限公司', '台北市松山區新中街52巷22號7樓', '0227660252', '絨毛玩具', '2019-01-08'),
(2, '立昇實業股份有限公司', '新北市新莊區新樹路268巷18號', '0222028608', '絨毛玩具', '2016-01-12'),
(3, '聖沃國際有限公司', '台北市內湖區成功路四段323巷9弄4號5樓', '0227945506', '絨毛玩具', '2015-01-13'),
(4, '振新文具有限公司', '台北市大同區太原路11巷35號', '0225505866', '絨毛玩具', '2017-06-15'),
(5, '華祐國際有限公司', '新北市新莊區新北大道四段187號13樓之1', '0285216716', '絨毛玩具', '2019-06-20'),
(6, '瑞志國際股份有限公司', '新北市中和區平河里 中正路７６４號４樓', '0282281628', '絨毛玩具', '2019-08-28'),
(7, '司麥樂企業有限公司', '台北市中山區敬業一路128巷28號2樓', '0285023198', '絨毛玩具', '2019-02-18'),
(8, '天琦實業有限公司', '新北市板橋區貴興路106巷16弄2號', '0229640072', '絨毛玩具', '2017-12-20'),
(9, '日椿國際有限公司', '新北市蘆洲區復興路105巷17號三樓', '0222822895', '絨毛玩具', '2020-10-14'),
(10, '派博國際有限公司', '台北市內湖區成功路4段323巷9弄4號', '0227925287', '絨毛玩具', '2021-12-16'),
(11, '兩儀事業股份有限公司', '台北市大安區忠孝東路三段197號3樓', '0227517728', '益智遊戲', '2021-09-21'),
(12, 'SunnyBaby生活館', '新竹縣竹東鎮竹美路二段109號', '035836368', '益智遊戲', '2020-01-13'),
(13, '品福事業有限公司', '高雄市三民區明吉路9號B1', '073495788', '益智遊戲', '2018-02-19'),
(14, '華泰玩具(玩具連鎖專賣店)', '宜蘭縣宜蘭市舊城東路35之1號', '039367113', '益智遊戲', '2019-01-28'),
(15, '三協資訊股份有限公司', '台中市南區美村路二段186號3樓之1', '0422627774', '益智遊戲', '2021-08-16'),
(16, '巧兒文化實業有限公司', '新北市中和區中山路二段315巷4號3樓', '0282422121', '益智遊戲', '2016-01-24'),
(17, '耕盛文教機構', '新北市新莊區中港一街157號1樓', '0222792900', '益智遊戲', '2015-02-10'),
(18, '東東數位科技有限公司', '新北市土城區中華路一段36號4樓之3', '0282261088', '益智遊戲', '2014-01-28'),
(19, '龍博士健康左右腦有限公司', '新北市中和區永和路337巷2號5樓', '0282287288~18', '益智遊戲', '2019-01-15'),
(20, '隆中網絡股份有限公司', '新北市新店區民權路95號14樓之1', '0222183785', '益智遊戲', '2018-02-20'),
(21, '東安生技實業股份有限公司', '台中市北屯區建和路二段206號', '0424368666', '生活用品', '2019-02-14'),
(22, '九乘九文具專家', '高雄市新興區中山二路522號', '072018899', '生活用品', '2013-09-18'),
(23, '佳一味企業社', '新北市三重區和平街39號', '0229747670', '生活用品', '2016-06-24'),
(24, '泰允創意有限公司', '桃園市桃園區藝文一街86之3號5樓', '033566818', '生活用品', '2021-01-22'),
(25, '璽悅婦兒有限公司', '台北市士林區中正路420號8樓', '0277292505', '生活用品', '2012-12-17'),
(26, '燁新國際有限公司', '桃園市中壢區內定五街39巷50之1號', '034632827', '生活用品', '2018-06-11'),
(27, '臺隆工業股份有限公司', '台北市中山區松江路261號6樓', '0225035508', '生活用品', '2016-01-29'),
(28, '建準電機工業股份有限公司', '高雄市前鎮區新衙路296巷30號', '078135888', '生活用品', '2018-03-15'),
(29, '天使學園網路股份有限公司', '台北市大安區信義路三段41號1樓', '0227015339', '生活用品', '2018-11-14'),
(30, '愛心進行銷設計股份有限公司', '台中市烏日區慶光路70之26號', '0423354628', '生活用品', '2017-01-17'),
(31, '何嘉仁國際文教團隊', '台北市中山區民權東路二段107號', '0225926998', '圖書', '2021-09-19'),
(32, '恩文事業', '台北市松山區南京東路4段186號9樓–7', '0225777011', '圖書', '2022-01-09'),
(33, '羅伯克林有限公司', '台北市士林區忠誠路二段130巷3號1樓', '0228725757', '圖書', '2022-01-23'),
(34, '繪豪企業有限公司', '新北市中和區中山路2段327巷20號3樓', '0222428968', '圖書', '2022-01-14'),
(35, '大輿出版社股份有限公司', '台北市萬華區廣州街189號4樓', '0223028768\r\n', '圖書', '2022-01-01'),
(36, '頂泰興資訊有限公司', '新北市中和區員山路512之7號4樓', '0222219869~112', '圖書', '2021-09-27'),
(37, '及第出版社\r\n', '台中市北區德化街269號1樓', '0422352519\r\n', '圖書', '2021-04-20'),
(38, '勤力國際股份有限公司', '新北市新店區寶高路20號', '0229106880', '圖書', '2019-01-21'),
(39, '建興文化事業有限公司', '新北市中和區立德街26巷5弄1之1號', '0222220866', '圖書', '2016-11-16'),
(40, '私立寰宇英日語短期補習班', '台南市中西區民族路二段153號6樓', '062237338\r\n', '圖書', '2018-06-15'),
(41, '網購韓服、日韓服飾、精品韓國衣服', '台中市北屯區大連路一段42號1樓', '0422916314', '服裝', '2017-07-15'),
(42, '凱蘿琳蔡時尚國際有限公司', '新北市三重區重新路五段609巷14號9樓之10', '0229998669', '服裝', '2016-08-08'),
(43, '双邦實業股份有限公司', '南投縣南投市永興路3號', '0492257450', '服裝', '2013-09-30'),
(44, '新力服裝有限公司', '台南市南區慶南街188號(金華公園大門口)', '062925161', '服裝', '2015-10-12'),
(45, '俊克服飾開發有限公司', '台北市中山區民權西路11號14樓', '0225859262\r\n', '服裝', '2016-01-27'),
(46, '雜碎江湖舞蹈戲劇服飾', '台南市永康區中華路12號13樓之3', '063136058\r\n', '服裝', '2018-02-26'),
(47, '擎普國際貿易有限公司', '台北市信義區信安街60號1樓', '0227325488', '服裝', '2017-05-12'),
(48, '銀穗國際企業股份有限公司', '台北市中山區民權西路42號5樓', '0225234655', '服裝', '2019-04-12'),
(49, '京城運動用品社', '屏東縣潮州鎮新生路141號', '087892010', '服裝', '2020-01-24'),
(50, '多田企業有限公司', '台北市大安區忠孝東路四段212號11樓', '022740-3096', '服裝', '2020-01-14'),
(51, '平價文具量販', '高雄市新興區中山二路522號', '072018899', '文具用品', '2015-11-30'),
(52, '鼎隆國際商業有限公司', '台中市西屯區台中港路二段124號', '0427065411', '文具用品', '2017-08-30'),
(53, '龍德數位科技有限公司', '台南市南區新和一路3巷3號', '062657021', '文具用品', '2019-07-24'),
(54, '金玉堂文具股份有限公司', '高雄市大寮區鳳屏一路729號', '077025666', '文具用品', '2016-06-22'),
(55, '藝群印刷公司(台北數位印刷)', '台北市中正區汀州路三段54號', '0227350157\r\n', '文具用品', '2017-01-20'),
(56, '大智通文化行銷股份有限公司', '新北市樹林區佳園路二段70之1號', '0226687017', '文具用品', '2017-07-17'),
(57, '金台北家居用品百貨', '新北市林口區南勢村8鄰77之36號', '0226093731', '文具用品', '2018-04-26'),
(58, '傳動數位設計印刷', '新北市三重區重新路三段111號12樓', '022986-6635', '文具用品', '2019-09-24'),
(59, '清豐企業股份有限公司', '台南市中西區成功路50號806室', '062221195', '文具用品', '2016-01-18'),
(60, '光南大批發', '屏東縣屏東市永福路31號', '087323266', '文具用品', '2018-01-22');

-- --------------------------------------------------------

--
-- 資料表結構 `商品規格`
--

CREATE TABLE `商品規格` (
  `sid` int(255) NOT NULL,
  `包裝長(cm)` int(255) NOT NULL,
  `包裝寬(cm)` int(255) NOT NULL,
  `包裝高(cm)` int(255) NOT NULL,
  `包裝重量(克)` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `商品規格`
--

INSERT INTO `商品規格` (`sid`, `包裝長(cm)`, `包裝寬(cm)`, `包裝高(cm)`, `包裝重量(克)`) VALUES
(1, 23, 24, 35, 123);

-- --------------------------------------------------------

--
-- 資料表結構 `商品訊息`
--

CREATE TABLE `商品訊息` (
  `sid` int(255) NOT NULL,
  `商品名稱` varchar(255) NOT NULL,
  `商品類型` int(255) NOT NULL,
  `商品規格` int(255) NOT NULL,
  `供應商` int(255) NOT NULL,
  `庫存訊息` int(255) NOT NULL,
  `商品價格` int(255) NOT NULL,
  `商品圖片` varchar(255) NOT NULL,
  `更新時間` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `商品訊息`
--

INSERT INTO `商品訊息` (`sid`, `商品名稱`, `商品類型`, `商品規格`, `供應商`, `庫存訊息`, `商品價格`, `商品圖片`, `更新時間`) VALUES
(1, 'test', 3, 1, 27, 1, 250, '', '2022-01-01');

-- --------------------------------------------------------

--
-- 資料表結構 `商品類型`
--

CREATE TABLE `商品類型` (
  `sid` int(255) NOT NULL,
  `類別名稱` varchar(255) NOT NULL,
  `更新日期` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `商品類型`
--

INSERT INTO `商品類型` (`sid`, `類別名稱`, `更新日期`) VALUES
(1, '絨毛玩具', '2015-01-02'),
(2, '益智遊戲', '2017-01-04'),
(3, '生活用品', '2017-01-11'),
(4, '圖書', '2020-01-09'),
(5, '服裝', '2019-01-10'),
(6, '文具用品', '2019-01-15');

-- --------------------------------------------------------

--
-- 資料表結構 `庫存表`
--

CREATE TABLE `庫存表` (
  `sid` int(255) NOT NULL,
  `庫存類別` int(255) NOT NULL,
  `倉庫數量` int(255) DEFAULT NULL,
  `現場數量` int(255) DEFAULT NULL,
  `現場位置` int(255) DEFAULT NULL,
  `更新時間` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `庫存表`
--

INSERT INTO `庫存表` (`sid`, `庫存類別`, `倉庫數量`, `現場數量`, `現場位置`, `更新時間`) VALUES
(1, 1, 233, 0, NULL, '2022-01-01');

-- --------------------------------------------------------

--
-- 資料表結構 `庫存類別`
--

CREATE TABLE `庫存類別` (
  `sid` int(255) NOT NULL,
  `庫存種類` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `庫存類別`
--

INSERT INTO `庫存類別` (`sid`, `庫存種類`) VALUES
(3, '網路及現場均有販售'),
(2, '限定現場販售'),
(1, '限定網路販售');

-- --------------------------------------------------------

--
-- 資料表結構 `現場館別`
--

CREATE TABLE `現場館別` (
  `sid` int(255) NOT NULL,
  `展場名稱` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `現場館別`
--

INSERT INTO `現場館別` (`sid`, `展場名稱`) VALUES
(4, '冰原'),
(2, '夜行'),
(3, '海底'),
(1, '熱帶');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `供應商`
--
ALTER TABLE `供應商`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `供應商名稱` (`供應商名稱`) USING BTREE;

--
-- 資料表索引 `商品規格`
--
ALTER TABLE `商品規格`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `sid` (`sid`);

--
-- 資料表索引 `商品訊息`
--
ALTER TABLE `商品訊息`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `商品圖片` (`商品圖片`),
  ADD UNIQUE KEY `商品名稱` (`商品名稱`),
  ADD KEY `供應商` (`供應商`),
  ADD KEY `商品類型` (`商品類型`),
  ADD KEY `商品規格` (`商品規格`),
  ADD KEY `sid` (`sid`),
  ADD KEY `庫存訊息` (`庫存訊息`);

--
-- 資料表索引 `商品類型`
--
ALTER TABLE `商品類型`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `類別名稱` (`類別名稱`);

--
-- 資料表索引 `庫存表`
--
ALTER TABLE `庫存表`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `sid` (`sid`),
  ADD KEY `庫存類別` (`庫存類別`),
  ADD KEY `現場位置` (`現場位置`);

--
-- 資料表索引 `庫存類別`
--
ALTER TABLE `庫存類別`
  ADD PRIMARY KEY (`sid`),
  ADD KEY `庫存種類` (`庫存種類`);

--
-- 資料表索引 `現場館別`
--
ALTER TABLE `現場館別`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `展場名稱` (`展場名稱`),
  ADD KEY `sid` (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `供應商`
--
ALTER TABLE `供應商`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `商品規格`
--
ALTER TABLE `商品規格`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `商品訊息`
--
ALTER TABLE `商品訊息`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `商品類型`
--
ALTER TABLE `商品類型`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `庫存表`
--
ALTER TABLE `庫存表`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `庫存類別`
--
ALTER TABLE `庫存類別`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `現場館別`
--
ALTER TABLE `現場館別`
  MODIFY `sid` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `商品訊息`
--
ALTER TABLE `商品訊息`
  ADD CONSTRAINT `商品訊息_ibfk_1` FOREIGN KEY (`供應商`) REFERENCES `供應商` (`sid`),
  ADD CONSTRAINT `商品訊息_ibfk_2` FOREIGN KEY (`商品類型`) REFERENCES `商品類型` (`sid`),
  ADD CONSTRAINT `商品訊息_ibfk_3` FOREIGN KEY (`商品規格`) REFERENCES `商品規格` (`sid`),
  ADD CONSTRAINT `商品訊息_ibfk_4` FOREIGN KEY (`庫存訊息`) REFERENCES `庫存表` (`sid`);

--
-- 資料表的限制式 `庫存表`
--
ALTER TABLE `庫存表`
  ADD CONSTRAINT `庫存表_ibfk_1` FOREIGN KEY (`庫存類別`) REFERENCES `庫存類別` (`sid`),
  ADD CONSTRAINT `庫存表_ibfk_2` FOREIGN KEY (`現場位置`) REFERENCES `現場館別` (`sid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
