-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-01-07 03:54:57
-- 伺服器版本： 10.4.22-MariaDB
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `wild_jungle`
--

-- --------------------------------------------------------

--
-- 資料表結構 `members`
--

CREATE TABLE `members` (
  `sid` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `mobile` varchar(255) NOT NULL,
  `birthday` date NOT NULL,
  `address` varchar(255) NOT NULL,
  `grade_sid` int(11) NOT NULL,
  `order_amount` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `members`
--

INSERT INTO `members` (`sid`, `email`, `name`, `password`, `mobile`, `birthday`, `address`, `grade_sid`, `order_amount`) VALUES
(6, 'tai3@gmail.com', '小陶3', '264153', '0925867143', '2012-04-26', '桃園市', 0, 0),
(7, 'tai4@gmail.com', '小陶4', '563124', '0936421875', '1990-04-06', '桃園市', 0, 0),
(8, 'tai5@gmail.com', '小陶5', '163425', '0938517462', '1982-05-13', '桃園市', 0, 0),
(9, 'tai6@gmail.com', '小陶6', '143265', '0936812574', '1997-02-27', '桃園市', 0, 0),
(10, 'tai7@gmail.com', '小陶7', '164253', '0952734168', '2021-02-26', '桃園市', 0, 0),
(11, 'tai8@gmail.com', '小陶8', '135264', '0978142356', '1971-12-25', '桃園市', 0, 0),
(12, 'tai9@gmail.com', '小陶9', '623154', '0953786421', '1999-06-22', '桃園市', 0, 0),
(13, 'tai10@gmail.com', '小陶10', '453261', '0985473216', '2016-02-24', '桃園市', 0, 0),
(14, 'tai11@gmail.com', '小陶11', '245613', '0931742856', '1990-12-15', '桃園市', 0, 0),
(15, 'tai12@gmail.com', '小陶12', '215436', '0956783142', '1981-08-22', '桃園市', 0, 0),
(16, 'tai13@gmail.com', '小陶13', '514632', '0945317862', '1999-03-07', '桃園市', 0, 0),
(17, 'tai14@gmail.com', '小陶14', '132465', '0938457216', '1976-04-24', '桃園市', 0, 0),
(18, 'tai15@gmail.com', '小陶15', '125643', '0918764532', '1995-09-03', '桃園市', 0, 0),
(19, 'tai16@gmail.com', '小陶16', '564132', '0984573261', '1986-09-19', '桃園市', 0, 0),
(20, 'tai17@gmail.com', '小陶17', '163452', '0964581372', '1974-10-22', '桃園市', 0, 0),
(21, 'tai18@gmail.com', '小陶18', '246513', '0925178346', '2006-08-26', '桃園市', 0, 0),
(22, 'tai19@gmail.com', '小陶19', '635241', '0974518236', '1988-11-17', '桃園市', 0, 0),
(23, 'tai20@gmail.com', '小陶20', '124365', '0984617235', '1983-10-27', '桃園市', 0, 0),
(24, 'tai21@gmail.com', '小陶21', '536412', '0948156237', '1990-06-26', '桃園市', 0, 0),
(25, 'tai22@gmail.com', '小陶22', '132564', '0968541372', '1993-06-25', '桃園市', 0, 0),
(26, 'tai23@gmail.com', '小陶23', '624135', '0958731462', '1991-03-28', '桃園市', 0, 0),
(27, 'tai24@gmail.com', '小陶24', '416235', '0956714382', '2008-12-14', '桃園市', 0, 0),
(28, 'tai25@gmail.com', '小陶25', '624531', '0964135728', '2006-06-21', '桃園市', 0, 0),
(29, 'tai26@gmail.com', '小陶26', '623154', '0987513264', '1977-06-06', '桃園市', 0, 0),
(30, 'tai27@gmail.com', '小陶27', '624153', '0967831254', '2018-10-01', '桃園市', 0, 0),
(31, 'tai28@gmail.com', '小陶28', '435162', '0953178462', '2003-12-18', '桃園市', 0, 0),
(32, 'tai29@gmail.com', '小陶29', '621543', '0971546238', '2014-03-26', '桃園市', 0, 0),
(33, 'tai30@gmail.com', '小陶30', '524631', '0938514672', '2002-08-05', '桃園市', 0, 0),
(34, 'tai31@gmail.com', '小陶31', '415236', '0965748213', '1979-07-23', '桃園市', 0, 0),
(35, 'tai32@gmail.com', '小陶32', '624315', '0972185436', '2010-12-16', '桃園市', 0, 0),
(36, 'tai33@gmail.com', '小陶33', '453612', '0925386147', '1982-02-27', '桃園市', 0, 0),
(37, 'tai34@gmail.com', '小陶34', '164532', '0948236715', '2019-02-15', '桃園市', 0, 0),
(38, 'tai35@gmail.com', '小陶35', '456312', '0984762351', '2019-09-06', '桃園市', 0, 0),
(39, 'tai36@gmail.com', '小陶36', '612453', '0974125836', '2008-05-16', '桃園市', 0, 0),
(40, 'tai37@gmail.com', '小陶37', '136254', '0921765483', '1999-01-01', '桃園市', 0, 0),
(41, 'tai38@gmail.com', '小陶38', '526314', '0927184653', '2003-02-03', '桃園市', 0, 0),
(42, 'tai39@gmail.com', '小陶39', '521436', '0968753241', '2015-06-29', '桃園市', 0, 0),
(43, 'tai40@gmail.com', '小陶40', '254613', '0976451238', '1991-07-26', '桃園市', 0, 0),
(44, 'tai41@gmail.com', '小陶41', '453612', '0928314765', '2019-07-26', '桃園市', 0, 0),
(45, 'tai42@gmail.com', '小陶42', '162534', '0983741562', '1989-12-21', '桃園市', 0, 0),
(46, 'tai43@gmail.com', '小陶43', '416325', '0934687215', '1987-07-10', '桃園市', 0, 0),
(47, 'tai44@gmail.com', '小陶44', '145326', '0917356284', '1983-04-30', '桃園市', 0, 0),
(48, 'tai45@gmail.com', '小陶45', '423165', '0974682315', '2007-01-27', '桃園市', 0, 0),
(49, 'tai46@gmail.com', '小陶46', '534612', '0917423685', '1990-12-20', '桃園市', 0, 0),
(50, 'tai47@gmail.com', '小陶47', '624135', '0986524173', '2019-10-23', '桃園市', 0, 0),
(51, 'tai48@gmail.com', '小陶48', '342651', '0984723156', '2002-04-28', '桃園市', 0, 0),
(52, 'tai49@gmail.com', '小陶49', '351246', '0934728651', '1985-08-08', '桃園市', 0, 0),
(53, 'tai50@gmail.com', '小陶50', '134652', '0914826537', '1970-07-13', '桃園市', 0, 0),
(54, 'tai51@gmail.com', '小陶51', '541236', '0928164573', '1975-02-26', '桃園市', 0, 0),
(55, 'tai52@gmail.com', '小陶52', '214356', '0928634175', '2010-05-30', '桃園市', 0, 0),
(57, 'tai54@gmail.com', '小陶54', '263514', '0951627834', '1985-12-07', '桃園市', 0, 0),
(58, 'tai55@gmail.com', '小陶55', '264513', '0983652471', '2021-04-30', '桃園市', 0, 0),
(59, 'tai56@gmail.com', '小陶56', '612354', '0946217538', '1984-04-25', '桃園市', 0, 0),
(60, 'tai57@gmail.com', '小陶57', '531624', '0958314627', '2000-01-31', '桃園市', 0, 0),
(61, 'tai58@gmail.com', '小陶58', '256134', '0924517683', '1996-04-30', '桃園市', 0, 0),
(62, 'tai59@gmail.com', '小陶59', '234156', '0987356412', '2014-02-14', '桃園市', 0, 0),
(63, 'tai60@gmail.com', '小陶60', '342615', '0948716523', '1987-11-21', '桃園市', 0, 0),
(64, 'tai61@gmail.com', '小陶61', '642351', '0957614238', '1973-01-20', '桃園市', 0, 0),
(65, 'tai62@gmail.com', '小陶62', '531426', '0927348615', '2013-04-02', '桃園市', 0, 0),
(66, 'tai63@gmail.com', '小陶63', '563241', '0985267143', '1992-10-12', '桃園市', 0, 0),
(95, 'tai92@gmail.com', '小陶92', '431625', '0914835276', '2018-07-04', '桃園市', 0, 0),
(99, 'tai96@gmail.com', '小陶96', '641325a', '0985472361', '2009-11-23', '桃園市', 0, 0),
(102, 'tai99@gmail.com', '小陶99', '412356', '0916327548', '2006-06-05', '桃園市', 3, 0),
(103, 'dfaGS@cc.com', '小dad', 'dwfwfh', '0912555777', '2022-01-13', '高雄市', 2, 0),
(106, 'aaa@gmail.com', 'hrrh', 'htjtjtrrk', '0988223333', '2022-01-28', '', 0, 0),
(107, 'qrweg@hh.com', 'wrgg', 'wgagr', '0988999777', '2021-12-14', '台北市', 0, 0),
(108, 'gerg@gg.com', 'egerh', 'aheatrj', '0988999777', '2021-12-27', '台北市', 0, 0),
(109, 'aaa@gmail.com', '李小', '432561wdw', '0988999777', '2022-01-28', '', 0, 0),
(110, 'ming@gg.com', '李小', '432561wdw', '0988999777', '2022-01-28', '', 1, 0),
(111, 'aaa@gmail.com', '李小', '432561wdw', '0988999777', '2022-01-28', '', 3, 0),
(113, 'aaa@gmail.com', '李小', '432561wdw', '0988999777', '2021-12-26', '', 3, 0),
(125, 'ming@gg.com', '李小', '432561wdw', '0988999777', '2022-01-27', '', 2, 0),
(126, 'aaa@gmail.com', '李小', '432561wdw', '0988999777', '2022-01-26', '', 4, 0),
(127, 'tai9337@gmail.com', '小陶95dawda', '432561wdw', '0988223333', '2021-12-26', '', 2, 0),
(128, 'ming@gg.com', '小陶9733', '43256ed', '0988999777', '2021-11-30', '', 1, 0),
(129, 'ming@gg.com', '小陶9733', '43256ed', '0988999777', '2022-01-09', '', 3, 0),
(130, 'ming@gg.com', '李小', '432561wdw', '0988999777', '2022-01-17', '', 2, 0),
(131, 'aaa@gmail.com', '小陶9733', '43256ed', '0988999777', '2022-01-25', '', 1, 0),
(132, 'ming@gg.com', '小陶954', '432561wdw', '0988999777', '2022-01-27', '', 1, 0);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `members`
--
ALTER TABLE `members`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=133;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
