-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 01 月 07 日 05:57
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `room`
--

-- --------------------------------------------------------

--
-- 資料表結構 `room-detail`
--

CREATE TABLE `room-detail` (
  `sid` int(11) NOT NULL,
  `room-name` varchar(255) NOT NULL,
  `room-image` varchar(255) NOT NULL,
  `room-introduction` varchar(255) NOT NULL,
  `people` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL,
  `check-in-data` date NOT NULL,
  `check-out-data` date NOT NULL,
  `check-in-status` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `room-detail`
--

INSERT INTO `room-detail` (`sid`, `room-name`, `room-image`, `room-introduction`, `people`, `price`, `check-in-data`, `check-out-data`, `check-in-status`) VALUES
(1, '海洋房', '', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '2', '2200', '2022-02-02', '2022-02-03', '已付款未入住'),
(2, '夜行房', '', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '4', '3800', '2020-12-06', '2020-12-07', '已入住已付款'),
(3, '熱帶雨林房', '', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2022-03-01', '2022-03-02', '未入住未付款'),
(4, '冰原房', '', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '6', '5800', '2021-06-15', '2021-06-16', '已入住已付款'),
(5, '海洋房', '', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '4', '3800', '2019-08-12', '2019-08-13', '已付款未入住'),
(6, '海洋房', '', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '6', '5800', '2019-05-29', '2019-05-30', '已付款已入住'),
(7, '夜行房', '', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '6', '5800', '2017-05-09', '2017-05-10', '已入住已付款'),
(8, '夜行房', '', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '2', '2200', '2018-08-01', '2018-08-02', '已入住已付款'),
(9, '熱帶雨林房', '', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '2', '2200', '2022-03-10', '2022-03-11', '未入住未付款'),
(10, '熱帶雨林房', '', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '6', '5800', '2022-02-28', '2022-03-01', '未入住未付款'),
(11, '冰原房', '', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '2', '2200', '2021-02-09', '2021-02-10', '已入住已付款'),
(12, '冰原房', '', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '4', '3800', '2020-06-07', '2020-06-08', '已入住已付款'),
(40, '夜行房', '', 'vdffgjldfjxg', '4', '5800', '2022-01-13', '2022-01-14', '已付款未入住'),
(41, '海洋房', '', 'kjl;jl;joj', '2', '2200', '2022-01-07', '2022-01-08', '未入住未付款'),
(42, '海洋房', '', 'jhlinuhluihuighuil', '2', '2200', '2022-01-07', '2022-01-08', '未入住未付款'),
(43, '海洋房', '', 'ghujhliuhjkhjfgj', '2', '2200', '2022-01-14', '2022-01-15', '已付款未入住'),
(44, '海洋房', '', 'zfddfvgfdx', '2', '2200', '2022-01-07', '2022-01-08', '已付款未入住'),
(45, '海洋房', '', 'hnfshdtsrft', '2', '2200', '2022-01-08', '2022-01-09', '已付款未入住'),
(46, '海洋房', '', 'fsvfdvzfdagf', '2', '2200', '2022-01-08', '2022-01-09', '已付款未入住'),
(48, '海洋房', '', 'bgfxhbgfbg', '2', '2200', '2022-01-08', '2022-01-08', '未入住未付款'),
(49, '海洋房', '', 'fzdsgrdhgdt', '2', '2200', '2022-01-08', '2022-01-09', '已入住已付款'),
(50, '海洋房', '', 'gfdzgrdgsrdzgvfdgr', '2', '2200', '2022-01-08', '2022-01-09', '已付款未入住'),
(51, '海洋房', '', 'gdsgrdfzgfdgr', '2', '2200', '2022-01-13', '2022-01-14', '已付款未入住');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `room-detail`
--
ALTER TABLE `room-detail`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `room-detail`
--
ALTER TABLE `room-detail`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
