-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 01 月 12 日 04:00
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `room`
--

-- --------------------------------------------------------

--
-- 資料表結構 `room-detail`
--

CREATE TABLE `room-detail` (
  `sid` int(11) NOT NULL,
  `room-name` varchar(255) NOT NULL,
  `room-image` varchar(255) NOT NULL,
  `room-introduction` varchar(255) NOT NULL,
  `people` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL,
  `check-in-data` date NOT NULL,
  `check-out-data` date NOT NULL,
  `check-in-status` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `room-detail`
--

INSERT INTO `room-detail` (`sid`, `room-name`, `room-image`, `room-introduction`, `people`, `price`, `check-in-data`, `check-out-data`, `check-in-status`) VALUES
(1, '海洋房', 'a0049111188336df3e9707116297339bd336433d.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '2', '2200', '2022-02-02', '2022-02-03', '已付款未入住'),
(2, '夜行房', '8fd682a0db6a86dde6b881cf0e3c62e0e0d051b6.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '4', '3800', '2020-12-06', '2020-12-07', '已入住已付款'),
(3, '熱帶雨林房', 'd02cf28b24bc5b0243217e02948a81ba98eee518.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2022-03-01', '2022-03-02', '未入住未付款'),
(4, '冰原房', 'f8c85ca3897581f3f69ee7410bcdf28f1430507f.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受，卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '6', '5800', '2021-06-15', '2021-06-16', '已入住已付款'),
(5, '海洋房', '0164265671ead5fa342474d8259db63de8eab55f.png', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '4', '3800', '2019-08-12', '2019-08-13', '已付款未入住'),
(6, '海洋房', '4b0b86d32ed79c35b7a010455b289de6e9f15fa3.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '6', '5800', '2019-05-29', '2019-05-30', '未入住未付款'),
(7, '夜行房', '01f31856960af4a24a5e724fd7b5e965f5fc8c66.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '6', '5800', '2017-05-09', '2017-05-10', '已入住已付款'),
(8, '夜行房', '518fe4ed91449e340d4fb526a7dc4e2a1b23a59a.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '2', '2200', '2018-08-01', '2018-08-02', '已入住已付款'),
(9, '熱帶雨林房', 'cbd3b8545e891ba4b928312c63897ece9c5d8704.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '2', '2200', '2022-03-10', '2022-03-11', '未入住未付款'),
(10, '熱帶雨林房', '481cc9bb27125fb587876272089c1fbede1088cb.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '6', '5800', '2022-02-28', '2022-03-01', '未入住未付款'),
(11, '冰原房', '45f33258f8647b72f80d7b76e1aee60e3c9cee52.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '2', '2200', '2021-02-09', '2021-02-10', '已入住已付款'),
(12, '冰原房', '436428daa1901e1c295faf59eefa145353c1da97.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '4', '3800', '2020-06-07', '2020-06-08', '已入住已付款'),
(13, '夜行房', '774abbff5cc33b4190ab9f73bc76fc1c26db4fac.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '2', '2200', '2022-01-10', '2022-01-11', '已付款未入住'),
(14, '海洋房', 'ff363702e44325c4818c7a9f21359b4df195930b.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '2', '2200', '2022-01-13', '2022-01-14', '未入住未付款'),
(15, '熱帶雨林房', 'bce9615d1fe74a8ab0d350dc8ae13f7dbb264d41.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2022-01-14', '2022-01-15', '已付款未入住'),
(16, '海洋房', '19be83453cfa0e7227b5f9fd84b91b1d737ef6c1.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '2', '2200', '2022-01-12', '2022-01-13', '已付款未入住'),
(17, '冰原房', '498ebc9ca4c2df77c2b77320b87199f3cd3e94a8.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '4', '3800', '2019-06-12', '2019-06-13', '已入住已付款'),
(18, '冰原房', 'af36333d826e664085401057e4b48bf8dd7eff9b.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '6', '5800', '2018-02-20', '2018-02-21', '已入住已付款'),
(19, '熱帶雨林房', '6617454a91e4bf24bee4af228440d338094e3c7a.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2019-11-28', '2019-11-29', '已入住已付款'),
(20, '夜行房', '3a9c49c345c5ef7a65f536dbf0180108b0104fa7.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '6', '5800', '2020-05-10', '2020-05-11', '已入住已付款'),
(21, '夜行房', '7710961c3770fa46bab552c0c9b6776b51a664b3.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '2', '2200', '2019-10-15', '2019-10-16', '已入住已付款'),
(22, '夜行房', '19113652ed09b170d5014059bb9457eee5258caf.jpg', '窗外蔥鬱縱谷山脈與灑入房內的點點繁星，當夜幕低垂，伴隨星空與山林入眠，為旅行增添溫馨愉悅，累積滿滿幸福回憶。', '4', '3800', '2018-07-19', '2018-07-20', '未入住未付款'),
(23, '冰原房', '8c14daedc730f7a02f668ffe7fd221bc7e259d3f.jpg', '純白體驗，百分百的純粹享受。以白色為基底的空間，一種明亮寬敞、無壓力的視覺感受， 卸下長久的疲憊。一趟不複雜的旅行，正式與心溝通。', '2', '2200', '2021-11-12', '2021-11-13', '已入住已付款'),
(117, '熱帶雨林房', '7d7ceca61156f65b4dff11586633ba6c2bebe130.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '6', '5800', '2020-01-12', '2020-01-13', '已入住已付款'),
(118, '熱帶雨林房', '2b691de557cce360f5e0a98f0e2bb6b6cfaf4f0f.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2022-01-13', '2022-01-14', '已付款未入住'),
(119, '海洋房', '3b9f255fdff16642ef65a786337e64e62a481285.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '2', '2200', '2021-06-12', '2021-06-13', '已入住已付款'),
(120, '海洋房', 'fd0d5cd9cc0d179f78cbb7c366da44c83a28431b.jpg', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '4', '3800', '2020-05-12', '2020-05-13', '已入住已付款'),
(121, '海洋房', 'd68332f5bcb30866259ada7e41ba04b03952b559.png', '進入房間，映入眼簾的是蔚藍海岸的地毯及船艙造型的圓形海魚掛畫，浴室內獨特的圓形大鏡面及乾濕分離的衛浴設計，讓人沉浸在海底船艙的冒險遐想之中。', '6', '5800', '2021-06-18', '2021-06-19', '已入住已付款'),
(122, '熱帶雨林房', '29e976f67d6186e75b6783caf2cb09278e0a2120.jpg', '悠閒的度假時光，讓腦袋淨空的最佳時機。鬱鬱森林中的祕密空間…拋開繁瑣羈絆，悠閒、自在的靜謐，其實不難，一起逃離城市的喧擾，體驗最初的感動。', '4', '3800', '2021-10-13', '2021-10-14', '已入住已付款');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `room-detail`
--
ALTER TABLE `room-detail`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `room-detail`
--
ALTER TABLE `room-detail`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
